CSI API ETABS v1
cPointElm.CountConstraint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int CountConstraint(
	ref int Count,
	string Name = ""
)
Function CountConstraint (
	ByRef Count As Integer,
	Optional Name As String = ""
) As Integer
Dim instance As cPointElm
Dim Count As Integer
Dim Name As String
Dim returnValue As Integer
returnValue = instance.CountConstraint(Count,
	Name)
int CountConstraint(
	int% Count,
	String^ Name = L""
)
abstract CountConstraint :
        Count : int byref *
        ?Name : string
(* Defaults:
        let _Name = defaultArg Name ""
*)
-> int
Parameters
Count
Type: System.Int32
Name (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace